import { Container } from "@/components/shared/container";
import { Title } from "@/components/shared/title";


export default function Warranty() {
  return (
    <>
      <Container className="mt-10">
        <Title text="Гарантия" size="lg" className="font-extrabold" />
      </Container>

      <Container className="mt-10 pb-14">
        <div className="space-y-6">
        <p>
            Гарантия — это важный вопрос для каждого клиента. Мы понимаем, что при покупке ножей вы ожидаете, что они будут служить долго и эффективно выполнять свои задачи. Именно поэтому наша компания предоставляет гарантию 2 года на все ножи. Вы можете быть уверены в их качестве и надежности.
          </p>
          <p>
            На продукцию компании Ножи СПБ предоставляется гарантия сроком 1 год с момента покупки. Гарантия покрывает производственные дефекты, а также сервисное обслуживание.
          </p>
          <p>
            К неправильному использованию складных ножей относятся: открывание жестяных банок, использование ножа в качестве лома, использование ножа в качестве отвертки, рубка других ножей и твердых предметов, метание ножей, вбивание клина в полено ударами по обуху (батонинг), ковыряния.
          </p>
          <p>
            Гарантия не распространяется на сорванную резьбу крепления стеклобоя. Если стеклобой сильно перетянуть, то существует риск сорвать резьбу. Поэтому, обслуживая ножи со стеклобоем, рекомендуем не затягивать стеклобой очень сильно. Если у вас раскручивается стеклобой, рекомендуем использовать фиксатор резьбы или направить нож на сервисное обслуживание.
          </p>
          <p>
            Любые действия, такие как ковыряния, броски, удары, рубка, искусственное нагревание продукта или его частей, неверный уход, нахождение в жесткой/кислотной среде, сильное загрязнение, срыв резьбы из-за сильного закручивания, попытка самостоятельного ремонта или модификации, снимают ответственность с компании.
          </p>
          <p>
            Гарантия не покрывает коррозию металла, вызванную несвоевременным или неправильным уходом. Мы рекомендуем тщательно очищать нож после контакта с любым материалом, который может вызвать коррозию.
          </p>
          <p>
            Покрытие на клинке защищает от воздействия окружающей среды и придаёт эстетические характеристики. Однако неравномерное стирание покрытия при использовании — естественный процесс и не рассматривается как гарантийный случай.
          </p>
          <p>
            Появление люфта в ходе эксплуатации ножа не является гарантийным случаем. Люфт может возникнуть из-за естественного износа деталей или ослабления осевого винта.
          </p>
          <p>
            Определение гарантийного случая требует детальной оценки изделия, что невозможно провести удалённо без осмотра. Для этого необходимо направить изделие в наш сервисный центр. После осмотра специалисты определят природу дефектов — производственный брак или результат неправильной эксплуатации.
          </p>
          <p>
            Если случай подтверждён как гарантийный, вам будет предложен бесплатный ремонт или замена изделия. В случае неправильной эксплуатации возможен платный ремонт.
          </p>
          <p>
            Отправка товара в офис для сервисного обслуживания производится только после отправки фото, на котором видно состояние товара, на нашу электронную почту: <strong>fluttrium@gmail.com</strong>.
          </p>
          <p>
            Сервисное обслуживание ножей Ножи СПБ проводится бесплатно и не ограничено сроком гарантии. Включает чистку ножа, замену/ремонт фурнитуры, пружины, смазку трущихся элементов, восстановление резьбы крепления стеклобоя, заточку и репрофайлинг. Оплачивается только доставка.
          </p>
          <p>
            Если модель относится к ранним версиям, возможно, некоторых запчастей может не быть в наличии. В этом случае проводится полный сервис за исключением замены недостающих деталей.
          </p>
          <p>
            Если у вас возникли вопросы, свяжитесь с нами. Мы всегда готовы помочь и предоставить необходимую информацию.
          </p>
        </div>
      </Container>
    </>
  );
}
